pushkin = '''У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.'''

pushkin = pushkin.lower()
splited_pushkin = pushkin.split()

new_pushkin = []

for word in splited_pushkin:
    if word.isalpha():
        new_pushkin.append(word)
    elif word != '—':
        temp_word = word[:-1:]
        new_pushkin.append(temp_word)

max_quantity = 0
max_quantity_word = ''

for word in new_pushkin:
    if new_pushkin.count(word) > max_quantity:
        max_quantity = new_pushkin.count(word)
        max_quantity_word = word

print(f'Max quantity word is {max_quantity_word}')
