pushkin = '''У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.'''

pushkin = pushkin.lower()

splited_pushkin = pushkin.split()

print(splited_pushkin)
print()

words_quantity = 0

for i in splited_pushkin:
    if i != '—':
        words_quantity += 1

symbol_quantity = 0
a_quantity = 0

for i in pushkin:
    if i.isalpha():
        symbol_quantity += 1
        if i == 'а':
            a_quantity += 1

print(f"Words quantity is {words_quantity}")
print(f"Symbol quantity is {symbol_quantity}")
print(f"Letter a quantity is {a_quantity}")
